app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order('name ASC')
---
SELECT "categories".* FROM "categories" ORDER BY name ASC

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Young girls clothes"], ["description", "clothing for females from 18-30"], ["created_at", "2017-07-11 11:55:09.789241"], ["updated_at", "2017-07-11 11:55:09.789241"]]

  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "sds"], ["updated_at", "2017-07-11 17:42:44.519819"], ["id", 4]]

  def show
    @products = Product.where(category: @category)
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = 2

  def find_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]