app/controllers/home_controller.rb

SELECT COUNT(*) FROM "products"
---
  def index
    @title_message = 'Ruby on Rails for beginners 2017'
    @subtitle_message = 'Web shop demo application'
    @product_count = Product.count

SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
---
  def products
    @products = Product.all.order(price: :desc)