app/controllers/home_controller.rb

  def products
    @products = Product.all
---
SELECT "products".* FROM "products"