app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
---
  def index
    @products = Product.all.order(price: :desc)

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "description", "seller_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "dadas"], ["price", 22.0], ["created_at", "2017-07-11 17:27:35.024957"], ["updated_at", "2017-07-11 17:27:35.024957"], ["description", ""], ["seller_id", 1], ["category_id", 1]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 22.0], ["description", "nice dress"], ["updated_at", "2017-06-29 18:37:12.529218"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)