app/controllers/sellers_controller.rb

    def index
      @sellers = Seller.all.order(rating: :desc)
---
SELECT "sellers".* FROM "sellers" ORDER BY "sellers"."rating" DESC

    def show
      @products = Product.where(seller: @seller)
---
SELECT "products".* FROM "products" WHERE "products"."seller_id" = 4

    def create
      @seller = Seller.new(seller_params)

      if @seller.save
---
INSERT INTO "sellers" ("name", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pull and Bear"], ["rating", 8], ["created_at", "2017-07-10 20:05:39.272486"], ["updated_at", "2017-07-10 20:05:39.272486"]]

    def destroy
      @seller.destroy
---
DELETE FROM "sellers" WHERE "sellers"."id" = ?  [["id", 3]]

    def edit
      @seller = Seller.find params[:id]
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
      @seller = Seller.find(params[:id])

      if @seller.update(seller_params)
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "sellers" SET "rating" = ?, "updated_at" = ? WHERE "sellers"."id" = ?  [["rating", 10], ["updated_at", "2017-07-11 12:38:10.778086"], ["id", 2]]

    def find_seller
      @seller = Seller.find(params[:id])
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]