app/views/products/_form.html.erb

SELECT "sellers".* FROM "sellers"
---
  <%= form.label :seller_id %>
  <%= form.collection_select :seller_id, Seller.all, :id, :name, { prompt: 'Choose seller' }, class: 'form-control' %>

SELECT "categories".* FROM "categories"
---
  <%= form.label :category_id %>
  <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: 'Choose category' }, class: 'form-control' %>