app/views/products/new.html.erb

SELECT "sellers".* FROM "sellers"
---
<%= form.label :seller_id %>
<%= form.collection_select :seller_id, Seller.all, :id, :name, { prompt: 'Choose seller'}, class: 'form-control' %>